/**
 * eslint-disable react/no-unescaped-entities
 *
 * @format
 */

import { ListItem, UnorderedList, Box } from "@chakra-ui/react";

export const Admin = () => {
  return (
    <Box as='section'>
      <UnorderedList>
        <ListItem>
          Порушення правил дорожнього руху, такі як перевищення швидкості,
          проїзд на червоне світло, водіння у стані алкогольного сп'яніння тощо.
        </ListItem>
        <ListItem>
          Порушення правил громадського порядку, такі як зашкодження майна,
          руйнування громадського майна, домагання, шумові непристойності та
          інші.
        </ListItem>
        <ListItem>
          Порушення правил торгівлі та комерційної діяльності, такі як продаж
          алкоголю несовершеннолетнім, порушення вимог до маркування товарів
          тощо.
        </ListItem>
        <ListItem>
          Порушення правил державного контролю та нагляду, такі як порушення
          правил безпеки промислових об'єктів, відсутність необхідних дозволів
          та ліцензій тощо.
        </ListItem>
        <ListItem>
          Порушення правил митного контролю, такі як спроба вивезти з країни
          товари, що потребують спеціальних дозволів, неоподатковуваних товарів,
          порушення вимог до декларування товарів тощо.
        </ListItem>
      </UnorderedList>
    </Box>
  );
};
