import {
  Container,
  Box,
  Image,
  Text,
  List,
  ListItem,
  Icon
} from "@chakra-ui/react";
import { qoutes } from "../components/qotes";
import { useState } from "react";
import s from "./Style.module.css";
import { useEffect } from "react";
import {BsCheck} from 'react-icons/bs'

export const Home = () => {
  const [index, setindex] = useState("");

  useEffect(() => {
    const textChange = setInterval(() => {
      const idx = Math.floor(Math.random() * (5 - 0)) + 0;
      setindex(qoutes[idx]);
    }, 10000);

    return () => clearTimeout(textChange);
  }, []);

  return (
    <>
      <Container as='section' maxW='100vw' centerContent pt={["50px", "75px"]}>
        <Box
          w={["xs", "sm", "md", "4xl", "6xl"]}
          gridGap={[2, 4]}
          pos='relative'>
          <Image
            src='https://live.staticflickr.com/65535/52695054909_3821cea83a_z.jpg'
            alt='femida'
            w={["320px", "320px", "448px"]}
            h={["412px", "412px", "577px"]}
            mr={["0", "0", "0", 4, 6]}
            ml={["0", "0", "0", 4, 6]}
            float={["bottom", "bottom", "bottom", "left"]}
            mt={[0, 4]}
            loading='lazy'></Image>
          <Box
            p={[2, 4]}
            pos='absolute'
            color='whiteAlpha.800'
            transform={[
              "translateY(-100%)",
              "translateY(-100%)",
              "translateY(-100%)",
              "translateY(-100%)",
              "translate(20px, 20px)",
            ]}
            w='320px'>
            <Text as='i' className={s.change}>
              {index}
            </Text>
          </Box>
          <Box as='article' w={["320px", "320px", "448px", "auto"]} p={[2, 4]}>
            <Text>
              Юридичні проблеми можуть виникати в різних ситуаціях, як-от
              суперечки з іншими сторонами, контракти, ділові операції, тілесні
              ушкодження, кримінальні звинувачення, сімейні справи тощо. Вони
              можуть бути складними, напруженими та дорогими, якщо їх не
              розглядати належним чином. Ось чому важливо якнайшвидше зв’язатися
              з юристом, якщо ви залучені в будь-яку юридичну проблему або
              зіткнулися з нею.
            </Text>
            <br />
            <Text>
              Юрист – це професіонал, який має знання та досвід, щоб надати вам
              поради щодо ваших законних прав та обов’язків; представляти вас у
              переговорах або судових розглядах; захистити свої інтереси та
              активи; і шукайте найкращий можливий результат для вашої справи.
            </Text>
            <br />
            <Text bg='brand.300' as='i'>
              Якщо ви залучені або зіткнулися з будь-якою правовою проблемою, не
              зволікайте, якомога швидше зв’яжіться з юристом. Юрист може надати
              цінну допомогу та рекомендації, які можуть вплинути на успішне
              вирішення вашої правової проблеми.
            </Text>
            <br />
            <br />
            <Text>
              Ось деякі з переваг звернення до юриста для вирішення правових
              питань:
            </Text>
            <List m='0'>
              <ListItem>
                <Icon as={BsCheck} />
                допомогти вам зрозуміти закон і його застосування до вашої
                ситуації. Закон складний і постійно змінюється.
              </ListItem>
              <ListItem>
                <Icon as={BsCheck} />
                пояснити відповідні закони та нормативні акти, які стосуються
                вашої справи; визначити юридичні питання та пов'язані ризики; і
                консультувати вас щодо ваших варіантів і стратегій на майбутнє.
              </ListItem>
              <ListItem>
                <Icon as={BsCheck} />
                допомогти вам уникнути або вирішити суперечки. Спори можуть
                виникати через непорозуміння, розбіжності або порушення
                контракту між сторонами.
              </ListItem>
              <ListItem>
                <Icon as={BsCheck} />
                допомогти вам спілкуватися з іншими сторонами; домовитися про
                справедливе та розумне врегулювання; проекти або перегляд
                контрактів чи угод; посередництво або арбітраж у суперечках; або
                подавати або захищати позови, якщо це необхідно.
              </ListItem>
              <ListItem>
                <Icon as={BsCheck} />
                заощадити час і гроші. На вирішення юридичних питань може
                знадобитися багато часу та грошей, якщо їх не вирішувати
                ефективно та результативно. Юрист може допомогти вам уникнути
                непотрібних затримок або витрат, взявши вашу справу професійно
                та швидко; збір доказів і документів; підготовка юридичних
                документів та документів; дотримання термінів і вимог; уникнення
                помилок або помилок; мінімізація конфліктів або ускладнень; тощо
              </ListItem>
              <ListItem>
                <Icon as={BsCheck} />
                досягти ваших цілей. Юридичні проблеми можуть мати значний вплив
                на ваше особисте чи професійне життя. Юрист може допомогти вам
                досягти ваших цілей, переслідуючи ваші інтереси та цілі;
                відстоювання ваших прав та інтересів; отримання сприятливих
                результатів у вашій справі, таких як компенсація, відшкодування
                збитків, судові заборони, виправдувальні вироки тощо;
                забезпечення дотримання законів і нормативних актів.
              </ListItem>
            </List>
            <br />
          </Box>
        </Box>
      </Container>
    </>
  );
};
