

export const servList = [
  {
    name: "Розірвання шлюбу",
    img: "https://live.staticflickr.com/65535/52693028779_d402f03bf1_q.jpg",
    description: "Розірвання шлюбу",
    link: "divorce",
  },
  {
    link: "alimony",
    description: "Аліменти під ключ",
    name: "Аліменти під ключ",
  },
  {
    name: "Справи про адміністративні правопорушення",
    description: "Справи про адміністративні правопорушення",
    img: "https://live.staticflickr.com/65535/52693191910_135747dcbf_q.jpg",
    link: "admin",
  },
  {
    name: "Представництво інтересів потерпілих у кримінальному провадженні",
    description:
      "Представництво інтересів потерпілих у кримінальному провадженні",
    img: "https://live.staticflickr.com/65535/52693252318_f1cec595b9_q.jpg",
    link: "criminal",
  },
  {
    name: "Спадкові спори",
    description:
      "Пропущення строку для прийняття спадщини, усунення від права на спадкування, визнання права власності в порядку спадкування, отримання права на обов'язкову частку в спадщині, тлумачення заповіту, встановлення факту прийняття спадщини, черговість спадкування за законом, визнання спадщини від умерлого.",
    img: "https://live.staticflickr.com/65535/52693252208_2a6db72d31_q.jpg",
    link: "inheritance",
  },
  {
    name: "Житлові спори",
    description:
      "Захист прав на володіння, розпорядження і користування житлом фізичних осіб і організацій",
    img: "https://live.staticflickr.com/65535/52692790981_66570d08dc_q.jpg",
    link: "housing",
  },
  {
    name: "Земельні спори",
    description:
      "Порушення права власності і користування земельною ділянкою між користувачами і землевласником",
    img: "https://live.staticflickr.com/65535/52693275638_b9f56cccaf_q.jpg",
    link: "landing",
  },
  {
    name: "Договірні правовідносини",
    description:
      "Вирішення питань порушення, а також роз’яснення по умовам догорів в т.ч. дарування, ренти, оренди, комерційної діяльності, підряду найму, позички, спільної діяльності, науково-дослідних і дослідно-конструкторських робіт, надання послуг, експедитування, перевезення,  зберігання,  доручення,страхування, комісії, управління майном, розпоряджання майновими правами інтелектуальної власності.",
    img: "https://live.staticflickr.com/65535/52693028754_8487097e23_q.jpg",
    link: "contract",
  },
];